<?php
	//файл должен быть после функции session_start()
	$domain = "http://localhost";
	$root_dir = "/cms/";
	$COMPANY_NAME = "АuRoom";
	$comp_telef1 = "8(831)200-34-98";
	$comp_telef2 = "+7 996 567 37 62";
	$email_comp = "auroom-nn@mail.ru";
	if(!array_key_exists('cityHeader', $_SESSION)){
		$_SESSION['cityHeader'] = "Нижний Новгород и обл.";
		$_SESSION['addres_comp'] = "г. Нижний Новгород Московское шоссе 105";
		$_SESSION['citytitle'] = "в Нижнем Новгороде";
	}

	if(array_key_exists("idGroup", $_GET)){

		$groupYDirect = array('5153947630'=>['г. Балахна', "г.Балахна ул. Челюскинцев, 10А", "в Балахне"],
							'5153947629' => ['г. Нижний Новгород и обл.', 'г. Нижний Новгород Московское ш. 105', 'в Нижнем Новгороде'],
							'5153947631' => ['г. Городец', 'г. Городец ул.Кирова, 25', "в Городце"],
							'5153947632' => ['г. Заволжье', 'г. Заволжье ул. Пономарёва, 2', "в Заволжье"],
							'5153947633' => ['г. Бор', 'г. Бор ул. Максима Горького, 90', "на Бору"],
							'5153947634' => ['г. Дзержинск', 'г. Дзержинск ул. Циолковского, 32А', "в Дзержинске"],
							'5153947635' => ['г. Богородск', 'г. Богородск ул. Ленина, 203', "в Богородске"],
							'5153947636' => ['г. Кстово', 'г. Кстово ул. Мира, 21А', "в г. Кстово"],
							'5153947637' => ['г. Павлово', 'г. Павлово ул. Аллея Ильича, 5', "в Павлово"]);


		$groupYDirect2 = array('5366403748'=>['г. Балахна', "г.Балахна ул. Челюскинцев, 10А", "в Балахне"],
							'5366403747' => ['г. Нижний Новгород и обл.', 'г. Нижний Новгород Московское ш. 105', 'в Нижнем Новгороде'],
							'5366403749' => ['г. Городец', 'г. Городец ул.Кирова, 25', "в Городце"],
							'5366403750' => ['г. Заволжье', 'г. Заволжье ул. Пономарёва, 2', "в Заволжье"],
							'5366403751' => ['г. Бор', 'г. Бор ул. Максима Горького, 90', "на Бору"],
							'5366403752' => ['г. Дзержинск', 'г. Дзержинск ул. Циолковского, 32А', "в Дзержинске"],
							'5366403753' => ['г. Богородск', 'г. Богородск ул. Ленина, 203', "в Богородске"],
							'5366403754' => ['г. Кстово', 'г. Кстово ул. Мира, 21А', "в г. Кстово"],
							'5366403755' => ['г. Павлово', 'г. Павлово ул. Аллея Ильича, 5', "в Павлово"]);

		$idg = $_GET['idGroup'];
		if(array_key_exists($_GET['idGroup'], $groupYDirect)){
			$_SESSION['cityHeader'] = $groupYDirect[$idg][0];
			$_SESSION['addres_comp'] = $groupYDirect[$idg][1];
			$_SESSION['citytitle'] = $groupYDirect[$idg][2];
		}elseif(array_key_exists($_GET['idGroup'], $groupYDirect2)){
			$_SESSION['cityHeader'] = $groupYDirect2[$idg][0];
			$_SESSION['addres_comp'] = $groupYDirect2[$idg][1];
			$_SESSION['citytitle'] = $groupYDirect2[$idg][2];
		}
	}
?>