<?php
	//файл должен быть после функции session_start()
	$domain = "http://localhost";
	$root_dir = "/cms/";
	$COMPANY_NAME = "АuRoom";
	$comp_telef1 = "8(831)200-34-98";
	$comp_telef2 = "+7 920 292 98 92";
	$email_comp = "auroom-nn@mail.ru";
	if(!array_key_exists('cityHeader', $_SESSION)){
		$_SESSION['cityHeader'] = "Нижний Новгород и обл.";
		$_SESSION['addres_comp'] = "г. Нижний Новгород Московское шоссе 105";
	}

	if(array_key_exists("idGroup", $_GET)){

		$groupYDirect = array('5138118267'=>['г. Балахна', "г.Балахна ул. Челюскинцев, 10А"],
							'5130600991' => ['г. Нижний Новгород и обл.', 'г. Нижний Новгород Московское ш. 105'],
							'5138120898' => ['г. Городец', 'г. Городец ул.Кирова, 25'],
							'5138126096' => ['г. Заволжье', 'г. Заволжье ул. Пономарёва, 2'],
							'5138127285' => ['г. Бор', 'г. Бор ул. Максима Горького, 90'],
							'5138128315' => ['г. Дзержинск', 'г. Дзержинск ул. Циолковского, 32А'],
							'5138143280' => ['г. Богородск', 'г. Богородск ул. Ленина, 203'],
							'5138145651' => ['г. Кстово', 'г. Кстово ул. Мира, 21А'],
							'5138182118' => ['г. Павлово', 'г. Павлово ул. Аллея Ильича, 5']);

		$idg = $_GET['idGroup'];
		if(array_key_exists($idg, $groupYDirect)){
			$_SESSION['addres_comp'] = $groupYDirect[$idg][1];
			$_SESSION['cityHeader'] = $groupYDirect[$idg][0];
		}
	}
?>