<?php
		
	global $dict;



	$res = $db->query("SELECT * FROM complect");
	$prod = [];

	while ($r = $res->fetchArray(SQLITE3_ASSOC)) {
		$prod[$r['name']] = $r;
	}

	$all_data = ["общ. периметр"=>0,
				"общ. площадь"=>0,
				"доп. углы"=>0,
				"установка люстра наклад."=>0,
				"установка люстра крюч." =>0,
				"установка спот встраив."=>0,
				"обвод тр"=>0,
				"установка накл. гардины"=>0,
				"установка разделителя"=>0,
				"каркас имитации стены"=>0,
				"установка принуд. вентиляции"=>0,
				"установка решетка вент."=>0,
				"установка гардины Lumfer UK"=>0,
				"установка гардины ПК-5"=>0,
				"установка световой линии"=>0,
				"обрыв световой линии"=>0,
				"установка блока питания"=>0,
				'установка парящего профиля'=>0,
				"установка теневого профиля алюм."=>0,
				"установка теневого профиля ПВХ"=>0,
				"установка контроллера"=>0,
				"установка диммера"=>0
				];

	$complect = [];

	$wall = ["бетон"=>0,
			"гипс\карт"=>0,
			"гипс\блок"=>0,
			"дерево"=>0,
			"кирпич"=>0,
			"керамика"=>0,
			"гранит"=>0];



	

	$sum_polotna =[];
	$sum_data = [];
	$sum_mat = [];
	$sum_wall = [];
	

	function add_tov($key_com, $val, $key_prod=false){
		global $prod, $complect;

		if(!$key_prod){
			$key_prod = $key_com;
		}

		if(array_key_exists($key_com, $complect)){
			$complect[$key_com]['кол.'] += $val;
			$complect[$key_com]['сумма'] += ceil($val * $prod[$key_prod]['price']);
		}else{
			$complect[$key_com] = [];
			$complect[$key_com]['ед.'] = $prod[$key_prod]['metric'];
			$complect[$key_com]['кол.'] = $val;
			$complect[$key_com]['цена'] = $prod[$key_prod]['price'];
			$complect[$key_com]['сумма'] = ceil($val * $prod[$key_prod]['price']);
		}
	}

	// основной цыкл расчета--------------------------------------------
	foreach ($rooms as $r) {
		$all_data['общ. периметр'] += $r->{'перим.'};
		$all_data['общ. площадь'] += $r->{'площадь'};
		$polotno = [];
		$polotno['м2'] = $r->{'площадь'};
		$polotno['фактура'] = $r->{'полотно'};
		$polotno['название комнаты'] = $r->{'название комнаты'};
		$sum_polotna[] = $polotno;

		foreach ($r->{'стены'} as $key => $value) {
			$wall[$key] += $value;
		}

		foreach ($r as $key => $value) {
			switch ($key) {
				case "доп. углы":
					$all_data['доп. углы'] += $r->{'доп. углы'};
					break;

				case "имитация стены":
					add_tov('брус 45х45', $value);
					$all_data['каркас имитации стены'] += $value;
					add_tov('кронштейн 125х150', ceil($value*2));
					break;

				case "разделитель":
					$all_data['установка разделителя'] += $value;
					add_tov('подвес', $value*2, "подвес");
					add_tov('доска 90х20', $value);
					add_tov('разделитель полотна алюм.', $value);
					add_tov('вставка в разделитель', $value);
					break;

				case 'люстры':
					foreach ($value as $lk => $lv) {
						if($lk == 'накладная'){
							$all_data['установка люстра наклад.'] += $lv;
							add_tov('доска 90х20', 0.5*$lv);
							add_tov('подвес', $lv*2);
						}
						if($lk == 'крючек'){
							$all_data['установка люстра крюч.'] += $lv;
						}
						add_tov('клемник', 2*$lv);
						add_tov('терм. кольцо 60', $lv, 'терм. кольцо станд.');
						add_tov('провод ПВС 2х0.75', $lv);
					}
					break;
				case "споты наши":
					foreach ($value as $lv) {
						$all_data['установка спот встраив.'] += $lv->{'шт'};
						add_tov("спот GX-53 ".$lv->{'цвет'}, $lv->{"шт"}, "спот GX-53");
						add_tov("лампа светод. GX-53 ".$lv->{'свечение'}." ".$lv->{"мощность"}, $lv->{"шт"}, "лампа GX-53");
						add_tov('терм. кольцо 90', $lv->{'шт'}, 'терм. кольцо станд.');
						add_tov('подвес', $lv->{'шт'});
						add_tov('платф. под спот 90', $lv->{'шт'});
						add_tov('клемник', 2*$lv->{'шт'});
						add_tov('провод ПВС 2х0.75', $lv->{'шт'});
					}
					break;
				case "споты клиента":
					foreach ($value as $lk => $lv){
						add_tov("кольцо ".$lk, $lv, 'терм. кольцо станд.');
						$all_data['установка спот встраив.'] += $lv;
						add_tov('подвес', $lv);
						add_tov('клемник', 2*$lv);
						add_tov('платф. под спот 60-110', $lv);
						add_tov('провод ПВС 2х0.75', $lv);
					}
					break;
				case "обвод тр":
					foreach ($value as $lk => $lv){
						add_tov("обвод тр. ".$lk, $lv, "обвод тр.");
					}

					break;

				case "вент":
					foreach ($value as $kvent => $ov) {				
						if($ov->{'принуд'}){
							$all_data['установка принуд. вентиляции'] += $ov->{'шт'};
							add_tov('брус 45х45', $ov->{'шт'} * 0.5);
							add_tov('подвес', $ov->{'шт'} *2);
							add_tov('провод ПВС 2х0.75', $ov->{'шт'} *2);
							add_tov("кольцо ".$ov->{'диам'}, $ov->{'шт'}, 'терм. кольцо бол.');
						}else{
							$all_data['установка решетка вент.'] += $ov->{'шт'};
							add_tov("решетка вент. ".$ov->{'диам'}, $ov->{'шт'}, 'решетка вент.');
						}
					}
					break;

				case "гардина накладная":
					foreach ($value as $vrag) {
						$all_data['установка накл. гардины'] += $vrag->{'м.п'};
						add_tov('брус 45х45', $vrag->{'м.п'} * 0.5);
						add_tov('подвес', ceil($vrag->{'м.п'}));
						if($vrag->{"с блендой"}){
							add_tov('ПВХ блэнда', $vrag->{'м.п'});
						}
						if($vrag->{"с углами"}){
							add_tov('ПВХ углы компл. 2шт', 1);
						}
						if(!$vrag->{'гардина клиента'}){
							add_tov("ПВХ гардина 2-х рядная ".$vrag->{'м.п'}." м.", $vrag->{'м.п'}, "ПВХ гардина 2-х рядная");
						}
					}
					break;
				case "гардина скрытая":
					foreach ($value as $vhid) {
						add_tov('кронштейн 125х150', ceil($vhid->{"м.п"} *2));						
						if($vhid->{"тип"} == "ПК-5"){
							$all_data["установка гардины ".$vhid->{"тип"}] += $vhid->{"м.п"};
							add_tov("гардина ".$vhid->{"тип"}." белый", $vhid->{"м.п"}, "гардина ПК-5");							
						}elseif ($vhid->{"тип"} == "Lumfer UK") {
							$all_data["установка гардины ".$vhid->{"тип"}] += $vhid->{"м.п"};
							add_tov("гарпун", ceil($vhid->{"м.п"} *2));
							add_tov("гардина Lumfer UK ".$vhid->{"цвет"}, $vhid->{"м.п"}, "гардина Lumfer UK");
							add_tov("комплект крючков для Lumfer", 1);
							add_tov('маскировочная вставка в Lumfer '.$vhid->{"цвет"},ceil($vhid->{"м.п"} *2), "вставка в гардину Lumfer UK");
							if($vhid->{"обрыв"} != ""){
								add_tov("торцевая заглюшка Lumfer UK ".$vhid->{"цвет"},$vhid->{"обрыв"}, 'торцевая заглюшка Lumfer UK');
							}
						}elseif($vhid->{'тип'}=="имитация стены"){
							$all_data["каркас имитации стены"] += $vhid->{"м.п"};
							add_tov('брус 45х45', $vhid->{'м.п'});
							if(!$vhid->{'гардина клиента'}){
								$all_data['установка накл. гардины'] += $vhid->{'м.п'};
								add_tov("ПВХ гардина 2-х рядная ".$vhid->{'м.п'}." м.", $vhid->{'м.п'}, "ПВХ гардина 2-х рядная");
								add_tov('Кручки 100шт для ПВХ гардины со стопорами 4шт комп.',1, "Комплект кручков со стопорами для ПВХ гардины");
							}
						}
						if($vhid->{'подсветка'}){
							$all_data['установка блока питания'] += 1;
							add_tov("Светод. лента 24V ".$vhid->{'мощность ленты'}."W ".$vhid->{'тип ленты'} , $vhid->{'м.п'}, "Светод. лента 24V ".$vhid->{'мощность ленты'}."W");
							$p = ceil((((int)$vhid->{'мощность ленты'} * (int)$vhid->{'м.п'})*1.2)/10)*10;
							add_tov("блок питания ".$p."W", 1, "блок питания 100W");
							if($vhid->{'тип ленты'}=="RGB"){
								$all_data['установка контроллера'] += 1;
								add_tov("Контроллер RGB", 1, "RGB контроллер");
							}
							if($vhid->{'тип'}=="Lumfer UK"){
								add_tov("Рассеиватель для гардины Lumfer", $vhid->{'м.п'});
							}
						}
					}
					break;
				case "световые линии":
					foreach ($value as $vsv) {
						$all_data["установка световой линии"] += $vsv->{'м.п'};
						add_tov("профиль ".$vsv->{'тип профиля'}, $vsv->{'м.п'}, "профиль ".$vsv->{'тип профиля'});
						add_tov("Светод. лента 24V ".$vsv->{'мощность ленты'}."W ".$vsv->{'тип ленты'}, $vsv->{'м.п'}*$vsv->{'кол. лент'}, "Светод. лента 24V ".$vsv->{'мощость ленты'}.'W');
						add_tov('кронштейн 125х150', ceil($vsv->{"м.п"} *1.6));
						add_tov("рассеватель полик. ".$vsv->{"тип профиля"}." ".$vsv->{"тип рассеивателя"}, $vsv->{'м.п'}, "рассеватель полик. ".$vsv->{"тип профиля"}." ".$vsv->{"тип рассеивателя"});
						add_tov('гарпун двойной', $vsv->{'м.п'});
						if($vsv->{'обрыв'} != ""){
							add_tov("заглушка ".$vsv->{"тип профиля"}, $vsv->{'обрыв'}, "заглушка для световой линии");
							$all_data["обрыв световой линии"] += $vsv->{'обрыв'};

						}
						$p = ceil((((int)$vsv->{'мощность ленты'} * ((int)$vsv->{'м.п'})*(int)$vsv->{'кол. лент'})*1.2)/10)*10;
						add_tov("блок питания ".$p."W", 1, "блок питания 100W");
						$all_data["установка блока питания"] += 1;
						if($vsv->{'Диммер'}){
							add_tov("Диммер",1);
							$all_data["установка диммера"] += 1;
						}
					}
					break;
				case "парящий":
					foreach ($value as $flv) {
						$all_data['установка парящего профиля'] += $flv->{'м.п'};						
						$all_data["установка блока питания"] += $flv->{"кол. блоков"};
						add_tov("блок питания ".$flv->{'блок мощ.'}, $flv->{"кол. блоков"});
						add_tov("парящий профиль ".$flv->{'тип профиля'}, $flv->{'м.п'});
						add_tov("Светод. лента 24V 12W ".$flv->{"тип ленты"}, $flv->{"м.п"}, "Светод. лента 24V 12W");
						if($flv->{'тип ленты'} == "RGB"){
							add_tov("RGB контроллер", 1);
							$all_data['установка контроллера'] += 1;
						}
					}
					break;
				case "теневой":
					foreach ($value as $flv) {
						$all_data['установка теневого профиля '.$flv->{"тип профиля"}] += $flv->{'м.п'};
						add_tov("профиль теневой ".$flv->{"тип профиля"},$flv->{'м.п'});
					}
					break;
				case "дополнительно":
					foreach ($value as $dv) {
						if(array_key_exists($dv->{'наименование'}, $complect)){
							$complect[$dv->{'наименование'}]['кол.'] += $dv->{'кол.'};
							$complect[$dv->{'наименование'}]['сумма'] += ceil($dv->{'кол.'} * $dv->{'цена'});
						}else{
							$complect[$dv->{'наименование'}] = [];
							$complect[$dv->{'наименование'}]['ед.'] = $dv->{'ед.'};
							$complect[$dv->{'наименование'}]['кол.'] = $dv->{'кол.'};
							$complect[$dv->{'наименование'}]['цена'] = $dv->{'цена'};;
							$complect[$dv->{'наименование'}]['сумма'] = ceil($dv->{'кол.'} * $dv->{'цена'});
						}
					}
					break;
			}
		}
	}

	add_tov('багет пвх', ceil($all_data['общ. периметр'] / 2.5) * 2.5);
	add_tov('маскировочная лента', ceil($all_data['общ. периметр']));

	function rollArr($arr, &$out){
		foreach ($arr as $key => $value) {
			if($value != 0){
				$out[$key] = $value;
			}
		}
	}
	rollArr($wall, $sum_wall);

	foreach ($sum_wall as $key => $value) {
		switch ($key) {
			case 'бетон':
				add_tov('саморезы 41', ceil($value / 0.12));
				add_tov('дупель 6х40', ceil($value / 0.12));
				break;		
			case "гипс\карт":
				add_tov('саморезы 41', ceil($value / 0.06));
				break;
			case "гипс\блок":
				add_tov('саморезы 41', ceil($value / 0.06));
				break;
			case "дерево":
				add_tov('саморезы 41', ceil($value / 0.12));
				break;
			case "кирпич":
				add_tov('саморезы 41', ceil($value / 0.12));
				add_tov('дупель 6х40', ceil($value / 0.12));
				break;
			case "керамика":
				add_tov('саморезы 41', ceil($value / 0.12));
				add_tov('дупель 6х40', ceil($value / 0.12));
				if($value > 15){
					add_tov('перо по кафелю', 1);
				}
				break;
			case 'гранит':
				add_tov('клей титан', 1);
				break;
		}
	}



	rollArr($all_data, $sum_data);


	$dict->sum_data = $sum_data;
	$dict->sum_wall = $sum_wall;
	$dict->sum_polotna = $sum_polotna;
	$dict->complect = $complect;

?>