<div class="padd_calcult"></div>
<div style="display: flex; justify-content: center; position: relative; margin-top: 50px;">
	<div class="vert_line"></div>
</div>
<?php
	$v = $GLOBALS['db']->querySingle("SELECT price FROM product WHERE id = 57");
?>
<div class="heder_present" style="position: relative; z-index: 2; margin-bottom: 50px;">
	<span>BAUF <?php echo $v?> руб/м2</span>
</div>

<div class="text_cont">	
	<p>BAUF – это немецкая торговая марка, зарегистрированная в городе Мюнхен.</p>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>ПВХ-пленка Bauf, созданная по самым передовым технологиям, соответствует высоким европейским стандартам качества.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Она абсолютно безопасна, в том числе для использования в помещениях для детей. Многочисленные сертификаты качества подтверждают прохождение экологических испытаний, продукт полностью безопасен в эксплуатации и для окружающей среды.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Подлинность материала гарантирует фирменная маркировка производителя, выполненная на каждом метре пленки.</p>
	</div>
</div>
<div class="img_cont">
	<img src="../img/vendorsFoilPage/BAUF.jpg">
</div>
<div class="text_cont">
	<h2>О бренде BAUF</h2>
	<p>В настоящий момент производитель Bauf занимает уверенную лидирующую позицию в рейтинге инновационного создания пленок для натяжных потолков. Компания является постоянным поставщиком материалов для установки натяжных потолков на протяжении десяти лет.</p>

	<p>Полотна Bauf проходят жесткий контроль качества, что исключает малейшую вероятность брака на всех этапах производства, от момента приема сырья на производство, до финального выпуска продукта. Таким образом немецкие технологи гарантируют высочайшее качество и сохранение уникальных характеристик ПВХ-пленок Bauf.</p>

	<p>Технологический процесс, разработанный в Германии, успешно применяется на заводах в Китае. Технология производства полностью соответствует европейским стандартам качества.</p>

	<p>Bauf – это качество, которое подтверждено сертификатами, полученными после проведения реальных испытаний в соответствии с требованиями Европейского союза</p>

	<p>Bauf – это продукт, созданный с заботой о природе. Безопасность для здоровья и экологии планеты, что подтверждено следующими сертификатами:</p>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p><span style="font-weight: 900;">А+</span> Все материалы Bauf имеют маркировку А+(лучший) в соответствии с европейским законодательством об уровне выбросов летучих органических соединений и качестве воздуха в помещении.</p>
	</div>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p><span style="font-weight: 900;">REACH</span> Регламент REACH (регистрация, оценка и разрешение химических веществ) регулирует деятельность всех производителей, импортеров и конечных потребителей химических веществ в Европейской экономической зоне. Программа разработана и производится в соответствии с требованиями Руководства Европейского химического агентства (ЕСНА) относительно содержания химических веществ в изделиях (версия от 2 апреля 2011 г.). Целью регламента REACH является контроль использования таких веществ путем их ограничения. Сертификат является подтверждением, что в составе материалов Bauf не содержатся опасные и вредные вещества.</p>
	</div>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p><span style="font-weight: 900;">EN71-3</span> Директивы по безопасности игрушек устанавливают ряд критериев безопасности, которым игрушки должны соответствовать, прежде чем они могут быть реализованы на рынке Европейского Союза. Игрушки должны соответствовать любым другим требованиям законодательства ЕС, применимым к ним. Пленка Bauf имеет разрешение использоваться даже в детских игрушках.</p>
	</div>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p><span style="font-weight: 900;">RoHS</span> Директива, ограничивающая содержание вредных веществ.</p>
	</div>

	<h2>Характеристики полотна BAUF</h2>

	<p>Натяжные полотна Bauf обладают особыми технологическими качествами, что выгодно выделяет их среди подобных материалов, представленных на рынке.</p>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Особая высокая поверхностная плотность ПВХ-полотна Bauf: 260 гр/м2 и 300 гр/м2.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Уникальная эластичность материала и предотвращение образования заломов за счет отсутствия в составе пленки известняка (мела). Отсутствие мела помогает пленке сохранять прочную структуру, не рваться по шву и крепко держать в крепежных профилях.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Улучшенные термостойкие свойства. Материал сохраняет все характеристики при значительном нагревании без оплавления. Повешенная безопасность и удобство в работе для специалистов любого уровня мастерства.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Пленка Bauf – абсолютно не просвечивает. Плотность материала и специальный состав позволяет полотну оставаться непрозрачным при любой степени натяжении и при любом освещении.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Белый цвет потолка остается безупречно белым и при искусственном освещении, и при естественном.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Различные вариантов оттенков белого полотна для реализации любых интерьерных идей. Ассортимент пленок Bauf представлен в матовом, глянцевом, сатиновом и полупрозрачном варианте. Матовый и глянцевый материалы выпускаются в теплом и холодном оттенке белого.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Полупрозрачная пленка поможет воплотить самые изысканные и сложные решения освещения.</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Пленка Bauf выпускается полотнами различной ширины: от 130 до 450 см.</p>
	</div>

	<h2>Таблица показателей пленки BAUF</h2>
</div>
<div class="price_table">
	<table>
		<thead>
			<tr>
				<td></td>
				<td>Bauf 230 (мат)</td>
				<td>Bauf 230 (глянец)</td>
				<td>Bauf 230 (сатин)</td>
				<td>Bauf 270 (мат)</td>
				<td>Bauf 270 (глянец)</td>
				<td>Bauf 270 (сатин)</td>
				<td>Другие производители</td>
			</tr>
		</thead>
		<tbody>
			<tr>
				<td>Плотность пленки, гр/кв.м</td>
				<td>250</td>
				<td>250</td>
				<td>250</td>
				<td>300</td>
				<td>300</td>
				<td>300</td>
				<td>200-230</td>
			</tr>
			<tr>
				<td>Прозрачность пленки</td>
				<td>102</td>
				<td>102</td>
				<td>102</td>
				<td>106</td>
				<td>106</td>
				<td>106</td>
				<td>87</td>
			</tr>
			<tr>
				<td>Отражение пленки (только глянца)</td>
				<td></td>
				<td>110</td>
				<td></td>
				<td></td>
				<td>110</td>
				<td></td>
				<td>95</td>
			</tr>
			<tr>
				<td>Толщина пленки (микрон)</td>
				<td>230</td>
				<td>195</td>
				<td>200</td>
				<td>270</td>
				<td>230</td>
				<td>240</td>
				<td>185-215</td>
			</tr>
			<tr>
				<td>Прочность на разрыв, Н</td>
				<td>23/30</td>
				<td>23/30</td>
				<td>23/30</td>
				<td>25/35</td>
				<td>25/35</td>
				<td></td>
				<td></td>
			</tr>
		</tbody>
	</table>
</div>


<?php
	$query = "все";
	$hashsSelect = ['#все'];
	include "templates/exampWorkFoto.php";
?>