<div class="padd_calcult"></div>
<div style="display: flex; justify-content: center; position: relative; margin-top: 50px;">
	<div class="vert_line"></div>
</div>
<?php
	$v = $GLOBALS['db']->querySingle("SELECT price FROM product WHERE id = 58");
?>
<div class="heder_present" style="position: relative; z-index: 2; margin-bottom: 50px;">
	<span>Teqtum <?php echo $v?> руб/м2</span>
</div>

<div class="text_cont">	
	<p>Производство натяжных потолков от бренда Teqtum осуществляется в Германии. Наличие собственной лаборатории в Мюнхене позволяет создавать качественные полотна, которые по эксплуатационным свойствам превосходят пленку ПВХ.</p>

	<p>Полотна подходят для установки в разных помещениях, включая общеобразовательные, воспитательные, медицинские.</p>

	<p>Пленка от производителя Teqtum из Германии кардинально отличается от традиционной поливинилхлоридной пленки. Он обладает высоким уровнем пожарной безопасности - класс KM2.</p>


	<p>Надежные, инновационные потолки из негорючего полотна разработаны специально для помещений с высокими требованиями к пожаробезопасности.</p>

	<h2>Скрытая маркировка на полотне</h2>
	<div class="img_cont">
		<img src="../img/vendorsFoilPage/fwefgbqqbqb.png">
	</div>

	<h2>О производителе Teqtum</h2>

	<p>Teqtum GmbH — производитель из Германии, существующий с 2018 года. Компания специализируется на производстве особой противопожарной пленки. Они применяются в коммерческих и частных учреждениях разного назначения, полностью адаптированы к высоким требованиям пожаробезопасности в России. Teqtum KM2 — линейка для коммерческих и общественных помещений, Teqtum EURO — для жилых домов и коттеджей. Экологически безопасная пленка выполнена в стандартном дизайнерском решении — она матовая, белого цвета. Ширина колеблется от 2,7 до 5 метров, поэтому допускается выполнение монтажа без швов или с минимальным количеством стыков.</p>

	<h2>Преимущества</h2>

	<p>Это единственный официально разрешенный для потолочной отделки, натяжной материал, который полностью безвреден, и при сильном нагревании не выделяет токсичных веществ (формальдегиды, фенолы, кадмий и тяжелые металлы). Потолки TEQTUM соответствуют высоким показателям прочности и термостойкости. К другим плюсам относятся:</p>

	<div class="note_defise">
		<div class="green_defise"></div>
		<p>отсутствие резкого, неприятного запаха, который часто имеют классические поливинилхлоридные пленки;</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>соответствие экологическим стандартам Евросоюза;</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>ультрафиолетовая маркировка по всему полотну — по ней можно легко отличить оригинал от подделки;</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>универсальность применения — в учреждениях образования и здравоохранения, культурно-просветительских организациях;</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>тотальная прочность и защита от негативного воздействия среды — в отличие от обычного ПВХ этот материал выдерживает большие нагрузки, не рвется, не растягивается, не утрачивает эксплуатационных свойств;</p>
	</div>
	<div class="note_defise">
		<div class="green_defise"></div>
		<p>высокая безопасность, подтвержденная сертификатами REACH, RoHS, EN-71.</p>
	</div>


	<div class="note_defise">
		<div class="green_defise"></div>
		<p>Изделия от немецкого бренда прошли все испытания МЧС России и получили одобрение для повсеместной эксплуатации, что подтверждено соответствующим сертификатом. Пленка безопасна для окружающей среды, здоровья и жизни людей.</p>
	</div>

	<p>Цена натяжных полотен из противопожарной пленки выше обычного материала ПВХ, но ниже текстильной продукции. Еще один плюс — простота ухода. Для удаления загрязнений, пыли не нужно использовать профессиональные средства. В процессе монтажа специалисты выбирают технологию «холодной» натяжки без применения тепловых пушек и другого сложного оборудования.</p>

	<p>Универсальные потолки марки Teqtum — не горят, защищают от распространения огня и не выделяют токсины. Абсолютная экологическая безопасность позволяет выбирать немецкую продукцию.</p>

</div>


<?php
	$query = "все";
	$hashsSelect = ['#все'];
	include "templates/exampWorkFoto.php";
?>
