	
	<link rel="stylesheet" type="text/css" href=<?php echo $root_dir."css/mainPage.css"?>>
	<script defer type="text/javascript" src=<?php echo $root_dir."js/mainPage.js"?>></script>
	<title>Натяжные потолки в Нижнем Новгороде и в обл.</title>
	<meta name="description" content='<?php echo "Натяжные потолки и интерьерные решения от компании $COMPANY_NAME. Самые интересные решения и самые выгодные цены. Световые линии, двухуровневые, фотопечать, парящие, теневые, резные натяжные потолки. Световые ниши. Наши поставщики пленки, сертификаты. Преимущества нашей компании, выгодные акции и предложения. Расчет стоимости прям на сайте. Примеры работ, цены. Отзывы наших клиентов, оставить отзыв на сайте. Ответы на часто задаваемые вопросы."?>'/>
</head>