	
	<link rel="stylesheet" type="text/css" href=<?php echo $GLOBALS['root_dir']."css/mainPage.css"?>>
	<title>Натяжные потолки в Нижнем Новгороде и в обл.</title>
	<?php 
		$comName = $GLOBALS['COMPANY_NAME'];
	?>
	<meta name="description" content='<?php echo "Натяжные потолки и интерьерные решения от компании $comName. Самые интересные решения и самые выгодные цены. Световые линии, двухуровневые, фотопечать, парящие, теневые, резные натяжные потолки. Световые ниши. Наши поставщики пленки, сертификаты. Преимущества нашей компании, выгодные акции и предложения. Расчет стоимости прям на сайте. Примеры работ, цены. Отзывы наших клиентов, оставить отзыв на сайте. Ответы на часто задаваемые вопросы."?>'/>
</head>