<div class="vert_line_cont device_vert">
	<div class="vert_line"></div>
</div>
<div class="heder_present" style="position: relative; z-index: 2;">
	<h1>Установим парящий<br>потолок</h1>
</div>


<div class="lightsLines_flex">
	<div class="lights_img_cont">
		<picture>
			<source srcset="../img/flying/18246695-pariashchii-potolok-84.webp" type="image/webp">
			<img src="../img/flying/18246695-pariashchii-potolok-84.jpg" alt="Парящие потолки и потолки с подсветкой">
		</picture>
	</div>
	<div class="lights_text">
		<span>Благодаря наличию большой разновидности всевозможный стеновых профилей можно создавать
			декоративную подсветку примыкание потолка к стене и теневой зазор, что придает объем потолку.
			Выбирая наш парящий профиль вы получаете два в одном и декоративную подсветку и теневой профиль.
			Также есть профиля просто теневые, без возможности установки светодиодной ленты. Они отлично
			подходят практически для всех помещений. Это хорошо смотрится когда поверхность стены
			имеет декоративную текстуру или же это может быть стена с красивыми обоями или допустим глянцевая
			плитка в ванной.
		</span>
		<?php
			$text_offer = "Заказать цена от 250 р/м.п";
			include "templates/zakaz_offer_block.php";
		?>
		<p>
			Подсветка по периметру может выполнять роль зонирования помещения, может служит ночником или
			приглушенным светом при просмотре телевизора. Еще в нашем арсенале имеется профиль подсветки по
			периметру принципиально другой конфигурации. Он больше похож на световые линии прям рядом со стеной.  
		</p>
	</div>
</div>